Обработки/Reports/_РасчетВознагражденияУК_ФОГФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасчетВознагражденияУК_ФОГФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьРасчетаВознагражденияУправляющего</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасчетВознагражденияУК_ФОГФ/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Расчет вознаграждения УК ФОГФ",
		"1.09",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ВидДоговораДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	Если Не ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчет предназначен только для счетов ДУ с видом 'Управление активами ФОГФ'");
		Возврат;
	КонецЕсли;
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
				
	Если Не ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран ответственный");
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.КонтактноеЛицо) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран ответственный");
		Возврат;
	КонецЕсли;
	
	СтруктураДанныхГлБухгалтера = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхГлБухгалтера", СтруктураДанныхГлБухгалтера);
				
	Если Не ЗначениеЗаполнено(СтруктураДанныхГлБухгалтера) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран главный бухгалтер");
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(СтруктураДанныхГлБухгалтера.КонтактноеЛицо) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран главный бухгалтер");
		Возврат;
	КонецЕсли;

	// Получим даты СЧА на начало и конец периода
	ТекДатаНачала		= НачалоДня(ЭтотОбъект.Период.ДатаНачала - 1);
	ТекДатаОкончания 	= НачалоДня(ЭтотОбъект.Период.ДатаОкончания);
		
	ДатаСЧАНаНачалоПериода 	= РегистрыСведений.НастройкиФормированияСЧА.ПолучитьБлижайшуюДатуФормированияСЧА(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ТекДатаНачала);
	ДатаСЧАНаКонецПериода 	= РегистрыСведений.НастройкиФормированияСЧА.ПолучитьБлижайшуюДатуФормированияСЧА(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ТекДатаОкончания);

	Если ДатаСЧАНаНачалоПериода = Неопределено Или ДатаСЧАНаКонецПериода = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчет не сформирован");	
		Возврат;
	КонецЕсли; 	
	
	// Фиксируем старт операции
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	Макет = ПолучитьМакет("Макет");
	ОбластьОтчет	= Макет.ПолучитьОбласть("Отчет");
	ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
		
	Запрос = Новый Запрос;	
	
	#ОБЛАСТЬ ТЕКСТ_ЗАПРОСА
	
	Запрос.Текст = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	|ПОМЕСТИТЬ _СчетаДоверительногоУправления
	|ИЗ
	|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(-ВЫБОР
	|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
	|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|							И НЕ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВводы), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОшибочноЗачисленные), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваПроцентЗаПользованиеДенежнымиСредствами))
	|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
	|				ТОГДА ВЫБОР
	|						КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|							ТОГДА -ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|						ИНАЧЕ ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ + ВЫБОР
	|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
	|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|							И НЕ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВыводы), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратОшибочноЗачисленных))
	|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
	|				ТОГДА ВЫБОР
	|						КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|							ТОГДА -ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|						ИНАЧЕ ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(-ВЫБОР
	|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
	|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|							И НЕ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВводы), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОшибочноЗачисленные), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваПроцентЗаПользованиеДенежнымиСредствами))
	|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
	|				ТОГДА ВЫБОР
	|						КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|							ТОГДА -ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|						ИНАЧЕ ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПоступлениеАктивов,
	|	СУММА(ВЫБОР
	|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
	|					И (ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|							И НЕ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС В (ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВыводы), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратОшибочноЗачисленных))
	|						ИЛИ ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства))
	|				ТОГДА ВЫБОР
	|						КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|							ТОГДА -ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|						ИНАЧЕ ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ИзъятиеАктивов,
	|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|ПОМЕСТИТЬ _ВводыВыводы
	|ИЗ
	|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета) КАК Сумма
	|ПОМЕСТИТЬ _СтоимостьПереоценки_НачалоПериода
	|ИЗ
	|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
	|ГДЕ
	|	СтоимостьПереоценки.Период = НАЧАЛОПЕРИОДА(&ДатаСЧАНаНачалоПериода, ДЕНЬ)
	|	И СтоимостьПереоценки.Организация = &Организация
	|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета) КАК Сумма
	|ПОМЕСТИТЬ _СтоимостьПереоценки_КонецПериода
	|ИЗ
	|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
	|ГДЕ
	|	СтоимостьПереоценки.Период = НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	|	И СтоимостьПереоценки.Организация = &Организация
	|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета) КАК Сумма
	|ПОМЕСТИТЬ _АктивыНеЦБ_КонецПериода
	|ИЗ
	|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
	|ГДЕ
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
	|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = &ДатаСЧАНаКонецПериода
	|	И НЕ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|				И (ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета) КАК Сумма
	|ПОМЕСТИТЬ _АктивыНеЦБ_НачалоПериода
	|ИЗ
	|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
	|ГДЕ
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
	|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = &ДатаСЧАНаНачалоПериода
	|	И НЕ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|				И (ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК Справочник.ВидыЗадолженности)) = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход) КАК Сумма
	|ПОМЕСТИТЬ _НачисленноеВознаграждение
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
	|			НАЧАЛОПЕРИОДА(&ДатаНачала, ГОД),
	|			ДОБАВИТЬКДАТЕ(&ДатаНачала, СЕКУНДА, -1),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)) КАК ЗадолженностиПоДенежнымСредствамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(_СтоимостьПереоценки_НачалоПериода.Сумма, 0) + ЕСТЬNULL(_АктивыНеЦБ_НачалоПериода.Сумма, 0) КАК СЧА_НачалоПериода,
	|	ЕСТЬNULL(_СтоимостьПереоценки_КонецПериода.Сумма, 0) + ЕСТЬNULL(_АктивыНеЦБ_КонецПериода.Сумма, 0) КАК СЧА_КонецПериода,
	|	ЕСТЬNULL(_ВводыВыводы.ПоступлениеАктивов, 0) КАК ПоступлениеАктивов,
	|	ЕСТЬNULL(_ВводыВыводы.ИзъятиеАктивов, 0) КАК ИзъятиеАктивов,
	|	ЕСТЬNULL(_СтоимостьПереоценки_КонецПериода.Сумма, 0) + ЕСТЬNULL(_АктивыНеЦБ_КонецПериода.Сумма, 0) - ЕСТЬNULL(_ВводыВыводы.ПоступлениеАктивов, 0) + ЕСТЬNULL(_ВводыВыводы.ИзъятиеАктивов, 0) - (ЕСТЬNULL(_СтоимостьПереоценки_НачалоПериода.Сумма, 0) + ЕСТЬNULL(_АктивыНеЦБ_НачалоПериода.Сумма, 0)) КАК ПриростИмущества,
	|	ЕСТЬNULL(СЧАВСистеме_НачалоПериода.Значение, 0) КАК СЧАВСистеме_НачалоПериода,
	|	ЕСТЬNULL(СЧАВСистеме_КонецПериода.Значение, 0) КАК СЧАВСистеме_КонецПериода
	|ПОМЕСТИТЬ _ДанныеДляРасчетаВознаграждения
	|ИЗ
	|	_АктивыНеЦБ_НачалоПериода КАК _АктивыНеЦБ_НачалоПериода
	|		ПОЛНОЕ СОЕДИНЕНИЕ _АктивыНеЦБ_КонецПериода КАК _АктивыНеЦБ_КонецПериода
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ _СтоимостьПереоценки_НачалоПериода КАК _СтоимостьПереоценки_НачалоПериода
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ _СтоимостьПереоценки_КонецПериода КАК _СтоимостьПереоценки_КонецПериода
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ _ВводыВыводы КАК _ВводыВыводы
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК СЧАВСистеме_НачалоПериода
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК СЧАВСистеме_КонецПериода
	|		ПО (ИСТИНА)
	|ГДЕ
	|	СЧАВСистеме_НачалоПериода.Период = &ДатаСЧАНаНачалоПериода
	|	И СЧАВСистеме_НачалоПериода.Организация = &Организация
	|	И (ВЫРАЗИТЬ(СЧАВСистеме_НачалоПериода.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления)) = &СчетДоверительногоУправления
	|	И СЧАВСистеме_НачалоПериода.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
	|	И СЧАВСистеме_КонецПериода.Период = &ДатаСЧАНаКонецПериода
	|	И СЧАВСистеме_КонецПериода.Организация = &Организация
	|	И (ВЫРАЗИТЬ(СЧАВСистеме_КонецПериода.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления)) = &СчетДоверительногоУправления
	|	И СЧАВСистеме_КонецПериода.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыОрганизации.ПолноеНаименованиеПоУставу КАК НаименованиеУК,
	|	РеквизитыКлиента.ПолноеНаименованиеПоУставу КАК НаименованиеКлиента,
	|	РеквизитыАнкетныеФОГФ.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеФОГФ,
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговораДУ,
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаДоговораДУ,
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|ИЗ
	|	_СчетаДоверительногоУправления КАК КлиентыДоверительногоУправленияСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|				&ДатаОкончания,
	|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И Организация = &Организация) КАК РеквизитыКлиента
	|		ПО (РеквизитыКлиента.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.Клиент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|				&ДатаОкончания,
	|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И Организация = &Организация) КАК РеквизитыОрганизации
	|		ПО (РеквизитыОрганизации.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация.ЮрФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|				&ДатаОкончания,
	|				Организация = &Организация
	|					И ЮрФизЛицо = &ФОГФ
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыАнкетныеФОГФ
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ДанныеДляРасчетаВознаграждения.СЧА_НачалоПериода КАК СЧА_НачалоПериода,
	|	_ДанныеДляРасчетаВознаграждения.СЧА_КонецПериода КАК СЧА_КонецПериода,
	|	_ДанныеДляРасчетаВознаграждения.ПоступлениеАктивов КАК ПоступлениеАктивов,
	|	_ДанныеДляРасчетаВознаграждения.ИзъятиеАктивов КАК ИзъятиеАктивов,
	|	_ДанныеДляРасчетаВознаграждения.ПриростИмущества КАК ПриростИмущества,
	|	_ДанныеДляРасчетаВознаграждения.СЧАВСистеме_НачалоПериода КАК СЧАВСистеме_НачалоПериода,
	|	_ДанныеДляРасчетаВознаграждения.СЧАВСистеме_КонецПериода КАК СЧАВСистеме_КонецПериода,
	|	НастройкиРасчетаСоставляющие.Периодичность КАК ПериодичностьРасчета,
	|	НастройкиРасчетаСоставляющие.БазаРасчета КАК БазаРасчета,
	|	НастройкиРасчетаСоставляющие.ПараметрыРасчета КАК ПараметрыБазыРасчета,
	|	ЕСТЬNULL(_НачисленноеВознаграждение.Сумма, 0) КАК НачисленноеВознаграждение,
	|	НастройкиРасчетаСоставляющие.Представление КАК Представление,
	|	НастройкиРасчетаВознагражденияУправляющегоСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения
	|ИЗ
	|	_ДанныеДляРасчетаВознаграждения КАК _ДанныеДляРасчетаВознаграждения,
	|	РегистрСведений.НастройкиРасчетаВознагражденияУправляющего.СрезПоследних(
	|			&ДатаОкончания,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидВознаграждения = ЗНАЧЕНИЕ(Перечисление.ВидыВознагражденийУправляющего.ВознаграждениеУправляющего)) КАК НастройкиРасчетаВознагражденияУправляющегоСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиРасчета.Составляющие КАК НастройкиРасчетаСоставляющие
	|		ПО НастройкиРасчетаВознагражденияУправляющегоСрезПоследних.НастройкаРасчета = НастройкиРасчетаСоставляющие.Ссылка
	|			И (НастройкиРасчетаСоставляющие.Периодичность = &ПериодичностьРасчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ _НачисленноеВознаграждение КАК _НачисленноеВознаграждение
	|		ПО (ИСТИНА)";
	
	#КОНЕЦОБЛАСТИ 
	
	Запрос.УстановитьПараметр("ДатаНачала", 					ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 					КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", 					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаСЧАНаНачалоПериода", 		ДатаСЧАНаНачалоПериода);
	Запрос.УстановитьПараметр("ДатаСЧАНаКонецПериода", 			ДатаСЧАНаКонецПериода);
	Запрос.УстановитьПараметр("ПериодичностьРасчета", 			ЭтотОбъект.ПериодичностьРасчета);
	Запрос.УстановитьПараметр("ФОГФ",						  	ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_ФОГФ"));
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ИндексПоследнегозапроса = ПакетЗапросов.ВГраница();
	
	// Вывод основной части
	Выборка = ПакетЗапросов[ИндексПоследнегоЗапроса - 1].Выбрать();

	НаименованиеКлиента = "";
	НаименованиеУК		= "";
	Если Выборка.Следующий() Тогда				
		ОбластьОтчет.Параметры.Заполнить(Выборка);	
		ОбластьОтчет.Параметры.ДатаДоговораДУ = Формат(Выборка.ДатаДоговораДУ, "ДЛФ=DD");
		ОбластьОтчет.Параметры.ПолноеНаименованиеФОГФРП = ПолучитьСклоненияСтроки(Выборка.ПолноеНаименованиеФОГФ, "", "ПД=Родительный")[0];
	КонецЕсли;
	
	Выборка = ПакетЗапросов[ИндексПоследнегоЗапроса].Выбрать();
	Если Выборка.Следующий() Тогда                   		
		ОбластьОтчет.Параметры.Заполнить(Выборка);
	КонецЕсли;
		
	ОбластьОтчет.Параметры.ДатаНачала 			= Формат(ЭтотОбъект.Период.ДатаНачала, "ДЛФ=DD");	
	ОбластьОтчет.Параметры.ДатаОкончания		= Формат(ЭтотОбъект.Период.ДатаОкончания, "ДЛФ=DD");	
	
	// При расчете вознаграждения за месяц СЧА в системе должна отличаться от СЧА в отчете на сумму вознаграждения управляющего.
	// Рассчитаем вознаграждение и проверим это для данных на конец периода	
	МассивРеквизитовБазыРасчета = Справочники.БазыРасчета.ПолучитьРеквизитыБазРасчета(Выборка.БазаРасчета);
	ЕстьРеквизитСтавка = Ложь;
	Для Каждого РеквизитБазыРасчета Из МассивРеквизитовБазыРасчета Цикл
		Если РеквизитБазыРасчета.Имя = "ПараметрРасчетаСтавка" Тогда
			ЕстьРеквизитСтавка = Истина;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Если Не ЕстьРеквизитСтавка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить ставку вознаграждения. Вознаграждение не рассчитано");
	Иначе
		СтавкаВознаграждения = Выборка.ПараметрыБазыРасчета.Получить().ПараметрРасчетаСтавка;	
		Вознаграждение = Окр(Выборка.ПриростИмущества * СтавкаВознаграждения / 100, 2, 1);
		ВознаграждениеСНачалаГода = Выборка.НачисленноеВознаграждение + Вознаграждение;
		ОбластьОтчет.Параметры.ВознаграждениеУК = Вознаграждение;
		ОбластьОтчет.Параметры.ВознаграждениеУКСНачалаГода = ВознаграждениеСНачалаГода;
		
		// Проверка		
		Если (НачалоМесяца(ЭтотОбъект.Период.ДатаОкончания) = ЭтотОбъект.Период.ДатаНачала) 
			И (КонецМесяца(ЭтотОбъект.Период.ДатаОкончания) = КонецДня(ЭтотОбъект.Период.ДатаОкончания))
			И (Выборка.СЧАВСистеме_КонецПериода + Вознаграждение <> Выборка.СЧА_КонецПериода) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетная СЧА на конец периода отличается от зарегистрированной в системе");			
		КонецЕсли;
	КонецЕсли;	
	
	ДокументРезультат.Вывести(ОбластьОтчет);
	
	// Подписи	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			
	// Подписи	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
	ОбластьПодвал.Параметры.Ответственный 		= СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	ОбластьПодвал.Параметры.ДолжностьДиректор 	= СтруктураДанныхКонтактногоЛица.Должность + " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий +  ")";

	ОбластьПодвал.Параметры.ГлавныйБухгалтер 	= СтруктураДанныхГлБухгалтера.КонтактноеЛицо;
	ОбластьПодвал.Параметры.ДолжностьГлавбух    = СтруктураДанныхГлБухгалтера.Должность;
	
	ДокументРезультат.Вывести(ОбластьПодвал);
		
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение операции
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
КонецПроцедуры
